# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растёт на круглой грядке, причём кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно 
# два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод
# — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, 
# которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном файле грядки.
from random import randint

def task24():
    size = int(input("Введите колличество кустов на грядке: "))
    garden_bed = [randint(0, 10) for _ in range(size)]
    count_max = 0
    max_list = [0 for _ in range(len(garden_bed))]
    print(garden_bed)
    for j in range(len(max_list)):
        for i in range(3):
            count_max = count_max + garden_bed[i]
        max_list[j] = count_max
        garden_bed.insert(0, garden_bed.pop(len(garden_bed) - 1))
    #    print(garden_bed)
        count_max = 0
    
    #print(max_list)
    print(max(max_list))

task24()